### DataFrame 연산 - 2
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 DataFrame 연산 수행

In [31]:
# 1. 모듈 로딩
import pandas as pd

In [32]:
# 2. 데이터 준비
data={'A':[98,78,100,52],
      'B':[97,75,1200,50]}

In [33]:
# 3. Dict데이터를 >>> DataFrame 형태로 저장
DF1=pd.DataFrame(data)
DF2=DF1/4

In [34]:
print(DF1, DF2, sep='\n\n')

     A     B
0   98    97
1   78    75
2  100  1200
3   52    50

      A       B
0  24.5   24.25
1  19.5   18.75
2  25.0  300.00
3  13.0   12.50

In [35]:
# 4. 연산수행
# - 산술연산
DF1 * DF2

        A          B
0  2401.0    2352.25
1  1521.0    1406.25
2  2500.0  360000.00
3   676.0     625.00

In [36]:
# - 비교연산
print(DF1 <= DF2, DF1 != DF2 , sep='\n\n')

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

      A     B
0  True  True
1  True  True
2  True  True
3  True  True

In [38]:
# 5. 연산 수행 => DataFrame과 Series
# - 산술연산
# - 'A'컬럼만 추출 (DF1.A > 한 행을 시리즈로 추출) 
print(DF1, DF2, sep='\n\n')
SR1 =DF1.A 
print('----------')
print(SR1)
print('----------')
SR1.index

     A     B
0   98    97
1   78    75
2  100  1200
3   52    50

      A       B
0  24.5   24.25
1  19.5   18.75
2  25.0  300.00
3  13.0   12.50
----------
0     98
1     78
2    100
3     52
Name: A, dtype: int64
----------

RangeIndex(start=0, stop=4, step=1)

In [ ]:
DF2.index, DF2.columns

(RangeIndex(start=0, stop=4, step=1), Index(['A', 'B'], dtype='object'))

In [ ]:
DF2 + SR1 # 데이터 프레임 + 시리즈 >>> 형이 맞지않아 nan출력

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [ ]:
# 방법1. SR1 ==> DF으로 변환
SRDF=SR1.to_frame()
SRDF

     A
0   98
1   78
2  100
3   52

In [ ]:
DF1 + SRDF # 시리즈를 데이터 프레임으로 형변환했는데 B자리에 숫자가 없기에 nan을 낸다.

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [ ]:
#DF1.columns=[0,1]
DF1.T

    0   1     2   3
A  98  78   100  52
B  97  75  1200  50

In [ ]:
# 방법2. 
SR1, DF1.T + SR1

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1     2    3
 A  196  156   200  104
 B  195  153  1300  102)